org/2023/9/21/ai-leaning-plan.org
#+OPTIONS: author:nil ^:{}
#+HUGO_BASE_DIR: ../../../../
#+HUGO_SECTION: post/2023/09
#+HUGO_CUSTOM_FRONT_MATTER: :toc true
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_DRAFT: false
#+DATE: [2023-09-21 四 09:56]
#+TITLE: AI roadmap
#+HUGO_TAGS:
#+HUGO_CATEGORIES: ai

* AI 必备基础与机器学习

** Python 基础及其工具包实战
*** Python 快速入⻔
*** 科学计算库-Numpy
*** 数据分析处理库-Pandas
*** 可视化库-Matplotlib
*** 可视化库-Seaborn

** 人工智能必备数学基础
*** 01.高等数学基础
*** 02.微积分
*** 03.泰勒公式与拉格朗日
*** 04.线性代数基础
*** 05.特征值与矩阵分解
*** 06.随机变量
*** 07.概率论基础
*** 08.数据科学你得知道的几种分布
*** 09.核函数变换
*** 10.熵与激活函数
*** 11.回归分析
*** 12.假设检验
*** 13.相关分析
*** 14.方差分析
*** 15.聚类分析
*** 16.⻉叶斯分析

** 第三模块机器学习算法精讲及其案例应用
*** 01.线性回归原理推导
*** 02.线性回归代码实现
*** 03.模型评估方法
*** 04.线性回归实验分析
*** 05.逻辑回归代码实现
*** 06.逻辑回归实验分析
*** 07.聚类算法-Kmeans&Dbscan 原理
*** 08.Kmeans 代码实现
*** 09.聚类算法实验分析
*** 10.决策树原理
*** 11.决策树代码实现
*** 12.决策树实验分析
*** 13.集成算法原理
*** 14.集成算法实验分析
*** 15.支持向量机原理推导
*** 16.支持向量机实验分析
*** 17.神经网络算法原理
*** 18.神经网络代码实现
*** 19.⻉叶斯算法原理
*** 20.⻉叶斯代码实现
*** 21.关联规则实战分析
*** 22.关联规则代码实现
*** 23.词向量 word2vec 通俗解读
*** 24.代码实现 word2vec 词向量模型
*** 25.推荐系统原理
*** 26.打造音乐推荐系统
*** 27.主成分分析
*** 28.线性判别分析
*** 29.主成分分析降维算法解读
*** 30.隐⻢尔科夫模型
*** 31.HIIM 应用实例

** 机器学习&数据挖掘项目实战
*** 1.机器学习
**** 01.Python 实战关联规则
**** 02.爱彼迎数据集分析与建模
**** 03.基于相似度的酒店推荐系统
**** 04.商品销售额回归分析
**** 05.绝地求生数据集探索分析与建模
**** 06.机器学习-模型解释方法实战
**** 07.NLP 常用工具包
**** 08.NLP 核心模型-word2vec
**** 09.自然语言处理特征提取方式对比
**** 10.数据特征预处理
**** 11.银行客戶还款可能性预测
**** 12.图像特征聚类分析实践

*** 2.数据挖掘
**** 01.快手用戶活跃度预测
**** 02.工业化生产预测
**** 03.智慧城市道路通行时间预测
**** 04.特征工程建模可解释工具包
**** 05.医学糖尿病数据命名实体识别
**** 06.贷款平台⻛控模型-特征工程
**** 07.新闻关键词抽取模型
**** 08.数据特征常用构建方法
**** 09.用电敏感客戶分类
**** 10.机器学习项目实战模板

** python 金融分析与量化交易实战
*** 01.金融时间序列分析
*** 02.双均线交易策略实例
*** 03.策略评估指标
*** 04.量化交易解读
*** 05.Ricequant 回测选股分析实战
*** 06.因子数据预处理
*** 07.因子策略选股实例
*** 08.因子分析实战
*** 09.因子打分选股实例
*** 10.基于回归的策略分析
*** 11.聚类与统计策略分析
*** 12.Fbprophet 时间测序预测神器
*** 13.深度学习时间序列预测
*** 14.Matplotlib 工具包实战
*** 15.Seaborn

* 计算机视觉算法及其项目实战

** 深度学习必备核心算法
*** 01.神经网络必备基础知识点
*** 02.神经网络前向传播与反向传播
*** 03.网络模型整体架构分析实例
*** 04.神经网络建模效果分析
*** 05.激活函数与过拟合问题解决
*** 06.卷积神经网络核心知识点
*** 07.卷积建模流程与各参数作用分析
*** 08.池化层的作用与效果
*** 09.经典卷积神经网络架构分析
*** 10.感受野的作用与效果解读
*** 11.递归神经网络模型原理分析
*** 12.RNN 系列网络结构优缺点分析
*** 13.词向量模型与 LSTM 应用实例

** 深度学习核心框架 PyTorch 与 Tensorflow
*** 一：深度学习框架 PyTorch
**** 01.PyTorch 框架基本处理操作
**** 02.神经网络实战分类与回归任务
**** 03.卷积神经网络原理与参数解读
**** 04.图像识别核心模块实战解读
**** 05.迁移学习的作用与应用实例
**** 06.计算机视觉模型通用训练策略
**** 07.Dataloader 构建自己的数据集
**** 08.Torch 框架自定义类与数据模块
**** 09.递归神经网络与词向量原理解读
**** 10.新闻数据集文本分类实战
*** 二：2.深度学习框架 Tensorflow
**** 01.tensorflow 安装与简介
**** 02.神经网络原理解读与整体架构
**** 03.搭建神经网络进行分类与回归任务
**** 04.卷积神经网络原理与参数解读
**** 05.猫狗识别实战
**** 06.图像数据增强实例
**** 07.训练策略-迁移学习实战
**** 08.递归神经网络与词向量原理解读
**** 09.基于 TensorFlow 实现 word2vec
**** 10.基于 RNN 模型进行文本分类任务
**** 11.将 CNN 网络应用于文本分类实战
**** 12.时间序列预测
**** 13.经典网络架构 Resnet 实战

** 三：Opencv 图像处理框架实战
*** 01.课程简介与环境配置
*** 02.图像基本操作
*** 03.阈值与平滑处理
*** 04.图像形态学操作
*** 05.图像梯度计算
*** 06.边缘检测
*** 07.图像金字塔与轮廓检测
*** 08.直方图与傅里叶变换
*** 09.信用卡数字识别
*** 10.文档扫描 OCR 识别
*** 11.图像特征-harris
*** 12.图像特征-sift
*** 13.全景图像拼接
*** 14.停⻋场⻋位识别
*** 15.答题卡识别判卷
*** 16.背景建模
*** 17.光流估计
*** 18.Opencv 的 DNN 模块
*** 19.目标追踪
*** 20.卷积原理与操作
*** 21.疲劳检测

** 四：综合项目-物体检测经典算法实战
*** 01.深度学习经典检测方法概述
*** 02.YOLO-V1 整体思想与网络架构
*** 03.YOLO-V2 改进细节详解
*** 04.YOLO-V3 核心网络模型
*** 05.基于 V3 版本进行源码解读
*** 06.基于 YOLO-V3 训练自己的数据集与任务
*** 07.YOLO-V4 版本算法解读
*** 08.V5 版本项目配置
*** 09.V5 项目工程源码解读
*** 10.Efficient net 模块解读
*** 11.Efficient Det 目标检测框架算法分析
*** 12.Efficient Det 源码分析与应用
*** 13.Detr 目标检测算法解读
*** 14.Detr 源码分析与应用实战
*** 15.Deformable DETR 算法改进解读
*** 16.Deformable DETR 源码解读与架构分析
*** 17.Fcos 算法如何提升检测速度
*** 18.可变形卷积效果分析与行人检测实例

** 五：图像分割实战
*** 01.图像分割及其损失函数概述
*** 02.卷积神经网络原理与参数解读
*** 03.Unet 系列算法讲解
*** 04.unet 医学细胞分割实战
*** 05.U2NET 显著性检测实战
*** 06.deeplab 系列算法
*** 07.基于 deeplabV3+版本进行 VOC 分割实战
*** 08.医学心脏视频数据集分割建模实战
*** 09.Medical Transformer 分割实战
*** 10.Medical Transformer 源码实现与应用实例
*** 11.可学习位置编码模块对分割算法的作用分析
*** 12.分割任务如何标注与训练自己的项目

** 六：走向 AI 论文实验与项目实战的捷径-MMLAB 实战系列
*** 01.MMLAB 系列环境搭建方法(以不变应万变)
*** 02.MMCLS 分类模块核心功能解读
*** 03.图像识别配置文件作用与功能解读
*** 04.图像识别任务标注方法与实例
*** 05.如何使用 MMCLS 构建自己分类数据集
*** 06.基于配置文件进行模型训练与测试任务
*** 07.可视化分析与评估指标生成方法
*** 08.MMSEG 图像分割模块核心功能解读
*** 09.图像分割配置文件作用与功能解读
*** 10.图像分割标注方法与实例
*** 11.如何使用 MMSEG 构建自己的分割数据集
*** 12.替换配置文件核心组件开启自己的实验任务
*** 13.CVPR 最新分割模块核心 backbone 解读
*** 14.源码分析 MMSEG 核心项目模块
*** 15.MMDET 物体检测模块核心功能解读
*** 16.物体检测配置文件作用与功能实例
*** 17.物体检测标注方法与应用实例
*** 18.使用 MMDET 训练自己的数据集与任务
*** 19.Deformable DETR 算法与论文分析
*** 20.Deformable DETR 源码解读实战
*** 21.MMOCR 核心模块解读
*** 22.OCR 中三大核心任务:检测,识别,抽取
*** 23.DBNET 文字检测算法与项目实战
*** 24.ANINET 文字识别算法与项目实战
*** 25.KIE 基于图模型的关键信息抽取算法及其实战
*** 26.MMGAN 对抗生成网络核心模块解读
*** 27.StyleGan 系列算法架构分析
*** 28.StyleGan 源码解读与应用
*** 29.MMEDIT 核心模块解读
*** 30.BasicVSR++视频超分辨重构算法与论文分析
*** 31.BasucVSR++源码分析与网络架构解读
*** 32.MMRAZOR 模型蒸馏与剪枝模块解读
*** 33.模型蒸馏算法及其应用实例
*** 34.模型剪枝算法及其应用实例

** 七：行为识别实战
*** 01.slowfast 算法知识点通俗解读
*** 02.slowfast 项目环境配置与配置文件
*** 03.slowfast 源码详细解读
*** 04.基于 3D 卷积的视频分析与动作识别
*** 05.视频异常检测算法与元学习
*** 06.CVPR2021 视频异常检测论文及其源码解读

** 八：2022 论文必备-Transformer 实战系列
*** 01.Transformer 基本架构解读
*** 02.注意力机制的作用与效果分析
