org/2023/9/21/ai-leaning-plan.org
*** 03.源码解读 Transformer 整体架构实现
*** 04.Transformer 在视觉中的应用 VIT 算法
*** 05.VIT 分类 Backbone 算法模型源码解读
*** 06.SwinTransformer 算法原理解析
*** 07.SwinTransformer 源码解读
*** 08.基于 Transformer 的 Detr 目标检测算法
*** 09.物体检测新型框架 Detr 源码解读
*** 10.Deformable DETR 算法与论文分析
*** 11.Deformable DETR 源码分析与架构实现
*** 12.基于 Transformer 的关键点匹配 Loftr
*** 13.商汤 Loftr 源码解读与应用实例
*** 14.Medical Transformer 应用于分割任务实例
*** 15.Medical Transformer 源码分析与应用实例
*** 16.Informer 时间序列预测任务解读
*** 17.Informer 源码解读与应用实战
*** 18.基于 Transformer 的 ANINET 文字识别
*** 19.文字识别项目源码分析与应用实例
*** 20.谷歌开源项目 BERT 源码解读与应用实例
*** 21.BERT 的中文情感分析实战
*** 22.最新热⻔Transformer 论文与实战解读

** 九：图神经网络实战
*** 01.图模型应用领域分析概述
*** 02.图神经网络 GNN 原理与架构解读
*** 03.图卷积 GCN 模块构建与效果
*** 04.图神经网络框架 PyTorch-Geometric 安装与配置
*** 05.图神经网络框架 PyTorch-Geometric 应用实战
*** 06.使用 PyTorch-Geometric 搭建自己的图数据集
*** 07.图注意力机制与图序列网络模型解读
*** 08.图神经网络时间序列预测实战
*** 09.图相似度计算与匹配算法解读
*** 10.化学分子相似度计算匹配实战
*** 11.基于图模型的 VectorNet 轨迹估计算法
*** 12.VectorNet 应用实例与源码分析
*** 13.基于图模型的 KIE 关键信息抽取
*** 14.KIE 算法与图模型构建实战解读

** 十：3D 点云实战
*** 01.3D 点云应用领域分析
*** 02.3D 点云 PointNet 算法
*** 03.PointNet++算法解读
*** 04.Pointnet++项目实战
*** 05.点云补全 PF-Net 论文解读
*** 06.点云补全实战解读
*** 07.点云配准及其案例实战

** 十一：目标追踪与姿态估计实战
*** 01.姿态估计算法经典套路分析
*** 02.姿态估计 OpenPose 论文分析
*** 03.姿态估计算法输出模块解读
*** 04.OpenPose 算法源码实战解读
*** 05.目标追踪要完成的任务分析
*** 06.deepsort 算法知识点解读
*** 07.卡尔曼滤波与状态估计实例
*** 08.REID 在追踪任务中的作用
*** 09.deepsort 项目源码解读
*** 10.YOLOV5 与 Deepsort 追踪实战

** 十二：面向深度学习的无人驾驶实战
*** 01.深度估计算法及其原理解读
*** 02.深度估计项目实战源码解读
*** 03.⻋道线检测论文及其算法实现
*** 04.基于深度学习的⻋道线检测项目实战
*** 05.轨迹预测实例与特征空间解读
*** 06.基于 VectorNet 进行估计估计实战
*** 07.特征点匹配方法原理与论文分析
*** 08.商汤最新特征点匹配算法实战
*** 09.三维重建算法原理分析
*** 10.TSDF 方法应用与解读
*** 11.商汤最新三维重建项目原理与源码解读
*** 12.特斯拉无人驾驶项目分析与技术细节解读

** 十三：对比学习与多模态任务实战
*** 01.对比学习核心思想与应用领域分析
*** 02.对比学习经典算法原理与架构解读
*** 03.对比学习与多模态融合方法
*** 04.Clip 算法流程分析与应用实例
*** 05.多模态 Clip 算法模型源码解读
*** 06.文本与视觉多模态任务结合分析
*** 07.Abinet 文本与视觉融合 OCR 论文解读
*** 08.文本视觉融合模型源码实战
*** 09.3D 点云与图像数据融合论文解读
*** 10.3D 目标检测多模态融合源码解读与实例

** 十四：缺陷检测实战
*** 01.物体检测框架 YOLO-V4 版本算法解读
*** 02.物体检测框架 YOLO-V5 版本项目配置
*** 03.物体检测框架 YOLO-V5 项目工程源码解读
*** 04.基于 YOLOV5 的钢材缺陷检测实战
*** 05.Semi-supervised 布料缺陷检测实战
*** 06.Opnecv 图像常用处理方法实例
*** 07.Opnecv 梯度计算与边缘检测实例
*** 08.Opnecv 轮廓检测与直方图
*** 09.基于 Opnecv 缺陷检测项目实战
*** 10.基于视频流水线的 Opnecv 缺陷检测项目
*** 11.图像分割 deeplab 系列算法
*** 12.基于 deeplabV3+版本进行 VOC 分割实战
*** 13.Deeplab 铁质材料缺陷检测与开源项目应用流程

** 十五：行人重识别实战
*** 01.行人重识别原理及其应用
*** 02.基于注意力机制的 ReId 模型论文解读
*** 03.基于 Attention 的行人重识别项目实战
*** 04.AAAI 顶会算法与论文精讲
*** 05.基于行人局部特征融合的再识别实战
*** 06.旷视研究院最新算法解读(基于图模型)
*** 07.基于拓扑图的行人重识别项目实战
*** 08.CVPR 最新行人搜索算法与应用实例
*** 09.行人搜索项目源码解读与效果分析


** 十六：对抗生成网络实战
*** 01.对抗生成网络架构原理与实战解析
*** 02.基于 CycleGan 开源项目实战图像合成
*** 03.stargan 论文架构解析
*** 04.stargan 项目实战及其源码解读
*** 05.基于 starganvc2 的变声器论文原理解读
*** 06.starganvc2 变声器项目实战及其源码解读
*** 07.图像超分辨率重构实战
*** 08.基于 GAN 的图像补全实战
*** 09.StyleGan 人脸合成算法解读
*** 10.StyleGan 项目源码解读实例
*** 11.BasicVSR++视频超分辨重构算法解读
*** 12.BasicVSR++项目源码实战

** 十七：强化学习实战系列
*** 01.强化学习简介及其应用
*** 02.PPO 算法与公式推导
*** 03.PPO 实战-月球登陆器训练实例
*** 04.Q-learning 与 DQN 算法
*** 05.DQN 算法实例演示
*** 06.DQN 改进与应用技巧
*** 07.Actor-Critic 算法分析(A3C)
*** 08.用 A3C 玩转超级⻢里奥

** 十八：Openai 顶级黑科技算法及其项目实战
*** 01.Openai 生成模型 GPT 系列算法解读
*** 02.GPT 架构实现与生成模型训练源码分析
*** 03.文本与视觉融合模型 CLIP 原理架构分析
*** 04.Diffusion 扩散模型算法思想解读
*** 05.扩散模型与 GAN 对比分析及其公式推导
*** 06.扩散模型源码实现与效果分析
*** 07.黑科技算法 Dalle 系列基本原理与架构分析
*** 08.Dalle2 源码解读及其应用流程实现

** 十九：面向医学领域的深度学习实战
*** 01.卷积神经网络原理与参数解读
*** 02.PyTorch 框架基本处理操作
*** 03.PyTorch 框架必备核心模块解读
*** 04.基于 Resnet 的医学数据集分类实战
*** 05.图像分割及其损失函数概述
*** 06.Unet 系列算法讲解
*** 07.Unet 医学细胞分割实战
*** 08.deeplab 系列算法
*** 09.基于 deeplabV3+版本进行 VOC 分割实战
*** 10.基于 deeplab 的心脏视频数据诊断分析
*** 11.YOLO 系列物体检测算法原理解读
*** 12.基于 YOLO5 细胞检测实战
*** 13.知识图谱原理解读
*** 14.Neo4j 数据库实战
*** 15.基于知识图谱的医药问答系统实战
*** 16.词向量模型与 RNN 网络架构
*** 17.医学糖尿病数据命名实体识别

** 二十：深度学习模型部署与剪枝优化实战
*** 01.PyTorch 框架部署实践
*** 02.YOLO 物体检测部署实例
*** 03.docker 实例演示
*** 04.tensorflflow-serving 实战
*** 05.模型减枝-NetworkSlimming 算法分析
*** 06.模型减枝-NetworkSlimming 实战解读
*** 07.轻量化模型 Mobilenet 三代网络模型架构
*** 08.Mobilenet 系列源码与应用实例
*** 09.模型蒸馏算法与应用实例
*** 10.模型蒸馏在分割任务中的实战
*** 11.模型加速与格式转换实战
*** 12.CV 各领域经典项目部署实例

* 自然语言处理算法及其项目实战

** 一：自然语言处理经典案例实战
*** 01.NLP 常用工具包实战
*** 02.商品信息可视化与文本分析
*** 03.⻉叶斯算法
*** 04.新闻分类任务实战
*** 05.HMM 隐⻢尔科夫模型
*** 06.HMM 工具包实战
*** 07.语言模型
*** 08.使用 Gemsim 构建词向量
*** 09.基于 word2vec 的分类任务
*** 10.NLP-文本特征方法对比
*** 11.NLP-相似度模型
*** 12.LSTM 情感分析
*** 13.机器人写唐诗
*** 14.对话机器人

** 二：自然语言处理必备神器 Huggingface 系列实战
*** 01.Huggingface 为 NLP 领域带来的变革与价值
*** 02.Huggingface 各核心模块使用方法及其应用流程
*** 03.MLM 完形填空任务解读及其训练应用实例
*** 04.文本摘要任务构建流程及其训练测试实例
*** 05.预训练模型的作用及其下游任务微调方法
*** 06.文本标注工具应用与各领域 NLP 任务标注实例
*** 07.谷歌 BERT 系列经典模型架构及其应用分析
*** 08.Openai 系列经典模型架构及其应用分析
*** 09.文本生成模型 GPT 算法应用实例
*** 10.作文与小说生成模型源码解读及其项目实战
*** 11.NER 命名实体识别项目流程及其应用实例
*** 12.如何训练自己的标注数据,格式转换实例
*** 13.文本实体抽取与关系抽取算法与模型解读
*** 14.实体与关系抽取项目源码解读分析

** 三：自然语言处理通用框架-BERT 实战
*** 01.自然语言处理通用框架 BERT 原理解读
*** 02.谷歌开源项目 BERT 源码解读与应用实例
*** 03.项目实战-基于 BERT 的中文情感分析实战
*** 04.项目实战-基于 BERT 的中文命名实体识别实战
*** 05.必备基知识点-word2vec 模型通俗解读
*** 06.必备基础-掌握 Tensorflow 如何
