org/2023/9/21/ai-leaning-plan.org
*** 07.必备基础知识点-RNN 网络架构与情感
*** 08.医学糖尿病数据命名实体识别

** 四：知识图谱实战系列
*** 01.知识图谱介绍及其应用领域分析
*** 02.知识图谱涉及技术点分析
*** 03.Neo4j 数据库实战
*** 04.使用 python 操作 neo4j 实例
*** 05.基于知识图谱的医药问答系统实战
*** 06.文本关系抽取实践
*** 07.金融平台⻛控模型实践
*** 08.医学糖尿病数据命名实体识别

** 五：语音识别实战系列
*** 01.seq2seq 序列网络模型
*** 02.LAS 模型语音识别实战
*** 03.starganvc2 变声器论文原理解读
*** 04.starganvc2 变声器源码实战
*** 05.语音分离 ConvTasnet 模型
*** 06.ConvTasnet 语音分离实战
*** 07.语音合成 tacotron 最新版实战

** 六：推荐系统实战系列
*** 01.推荐系统介绍及其应用
*** 02.协同过滤与矩阵分解
*** 03.音乐推荐系统实战
*** 04.知识图谱与 Neo4j 数据库实例
*** 05.基于知识图谱的电影推荐实战
*** 06.点击率估计 FM 与 DeepFM 算法
*** 07.DeepFM 算法实战
*** 08.推荐系统常用工具包演示
*** 09.基于文本数据的推荐实例
*** 10.基于统计分析的电影推荐
*** 11.基于相似度的酒店推荐系统
