content/post/2023/09/ai-leaning-plan.md


### 07.必备基础知识点-RNN 网络架构与情感 {#07-dot-必备基础知识点-rnn-网络架构与情感}


### 08.医学糖尿病数据命名实体识别 {#08-dot-医学糖尿病数据命名实体识别}


### 四：知识图谱实战系列 {#四-知识图谱实战系列}


### 01.知识图谱介绍及其应用领域分析 {#01-dot-知识图谱介绍及其应用领域分析}


### 02.知识图谱涉及技术点分析 {#02-dot-知识图谱涉及技术点分析}


### 03.Neo4j 数据库实战 {#03-dot-neo4j-数据库实战}


### 04.使用 python 操作 neo4j 实例 {#04-dot-使用-python-操作-neo4j-实例}


### 05.基于知识图谱的医药问答系统实战 {#05-dot-基于知识图谱的医药问答系统实战}


### 06.文本关系抽取实践 {#06-dot-文本关系抽取实践}


### 07.金融平台⻛控模型实践 {#07-dot-金融平台-控模型实践}


### 08.医学糖尿病数据命名实体识别 {#08-dot-医学糖尿病数据命名实体识别}


### 五：语音识别实战系列 {#五-语音识别实战系列}


### 01.seq2seq 序列网络模型 {#01-dot-seq2seq-序列网络模型}


### 02.LAS 模型语音识别实战 {#02-dot-las-模型语音识别实战}


### 03.starganvc2 变声器论文原理解读 {#03-dot-starganvc2-变声器论文原理解读}


### 04.starganvc2 变声器源码实战 {#04-dot-starganvc2-变声器源码实战}


### 05.语音分离 ConvTasnet 模型 {#05-dot-语音分离-convtasnet-模型}


### 06.ConvTasnet 语音分离实战 {#06-dot-convtasnet-语音分离实战}


### 07.语音合成 tacotron 最新版实战 {#07-dot-语音合成-tacotron-最新版实战}


### 六：推荐系统实战系列 {#六-推荐系统实战系列}


### 01.推荐系统介绍及其应用 {#01-dot-推荐系统介绍及其应用}


### 02.协同过滤与矩阵分解 {#02-dot-协同过滤与矩阵分解}


### 03.音乐推荐系统实战 {#03-dot-音乐推荐系统实战}


### 04.知识图谱与 Neo4j 数据库实例 {#04-dot-知识图谱与-neo4j-数据库实例}


### 05.基于知识图谱的电影推荐实战 {#05-dot-基于知识图谱的电影推荐实战}


### 06.点击率估计 FM 与 DeepFM 算法 {#06-dot-点击率估计-fm-与-deepfm-算法}


### 07.DeepFM 算法实战 {#07-dot-deepfm-算法实战}


### 08.推荐系统常用工具包演示 {#08-dot-推荐系统常用工具包演示}


### 09.基于文本数据的推荐实例 {#09-dot-基于文本数据的推荐实例}


### 10.基于统计分析的电影推荐 {#10-dot-基于统计分析的电影推荐}


### 11.基于相似度的酒店推荐系统 {#11-dot-基于相似度的酒店推荐系统}
